OdGeMatrix3d.op_FunctionCall(System.Int32,System.Int32)
\details
Returns or references entry[row][column] as matrix(row,column).
\param row [in]  Row.
\param column [in]  Column.
\details
Returns a matrix element specified with row and column.
\param row    [in]  Row of a matrix. Must be in range from 0 to 3.
\param column [in]  Column of a matrix. Must be in range from 0 to 3.
\details
Returns a reference to a matrix element specified with row and column.
\param row    [in]  Row of a matrix. Must be in range from 0 to 3.
\param column [in]  Column of a matrix. Must be in range from 0 to 3.

OdGeMatrix3d.op_Subscript(System.Int32)
\details
Returns or references entry[row] as matrix[row].
\param row [in]  Row.
\details
Returns a pointer to a constant matrix row.
\param row [in]  Row of a matrix. Must be in range from 0 to 3.
\details
Returns a pointer to a matrix row.
\param row [in]  Row of a matrix. Must be in range from 0 to 3.

OdGeMatrix3d.convertToLocal(OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Transforms the plane specified by a normal and an elevation.
\remarks
Returns the normal and elevation of the transformed plane, as well as
a 2D transformation matrix for transforming points in the
original plane coordinates to the transformed plane coordinates.
\param normal [in/out] Normal to the plane.
\param elevation [in/out] Elevation of the plane.

OdGeMatrix3d.norm
\details
Returns the largest absolute value of the linear part of this matrix.

OdGeMatrix3d.scale
\details
Returns the scale factor of this matrix.
\remarks
The scale factor is the square root of the longest column vector
of the linear part of this matrix.

OdGeMatrix3d.planeToWorld(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps
the plane coordinate system to the WCS.
\param plane [in]  The plane.

OdGeMatrix3d.planeToWorld(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps
the plane coordinate system to the WCS.
\param normal [in]  The normal to the plane.
\remarks
If normal is specified, the origin of the plane is (0,0,0)

OdGeMatrix3d.worldToPlane(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps the WCS to
the plane coordinate system.
\param plane [in]  The plane.

OdGeMatrix3d.worldToPlane(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps the WCS to
the plane coordinate system.
\param normal [in]  The normal to the plane.
\remarks
If normal is specified, the origin of the plane is (0,0,0).

OdGeMatrix3d.alignCoordSys(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerService
\details
Returns the matrix which maps
the coordinate system defined by fromOrigin, fromXAxis, fromYAxis, and fromZAxis,
to the coordinate system
defined by toOrigin, toXAxis, toYAxis, and toZAxis.
\param fromOrigin [in]  Origin of the initial coordinate system.
\param fromXAxis [in]  X-axis of the initial coordinate system.
\param fromYAxis [in]  Y-axis of the initial coordinate system.
\param fromZAxis [in]  Z-axis of the initial coordinate system.
\param toOrigin [in]  Origin of the initial coordinate system.
\param toXAxis [in]  X-axis of the initial coordinate system.
\param toYAxis [in]  Y-axis of the initial coordinate system.
\param toZAxis [in]  Z-axis of the initial coordinate system.

OdGeMatrix3d.projection(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which parallel
projects onto the specified plane in the
specified direction.
\param projectionPlane [in]  Projection plane.
\param projectDir [in]  Projection direction.

OdGeMatrix3d.mirroring(OdGeLine3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which mirrors
about the specified object, and returns a reference
to this matrix.
\param mirrorLine [in]  Mirror line entity.

OdGeMatrix3d.mirroring(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which mirrors
about the specified object, and returns a reference
to this matrix.
\param mirrorPoint [in]  Mirror point.

OdGeMatrix3d.mirroring(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which mirrors
about the specified object, and returns a reference
to this matrix.
\param mirrorPlane [in]  Mirror plane.

OdGeMatrix3d.scaling(OdGeScale3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which scales
by scale about center, and returns a reference
to this matrix.
\param scale [in]  Scale factor.
\param center [in]  Center of scaling.

OdGeMatrix3d.scaling(System.Double,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which scales
by scale about center, and returns a reference
to this matrix.
\param scale [in]  Scale factor.
\param center [in]  Center of scaling.

OdGeMatrix3d.rotation(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which rotates
by angle about an axis passing through center, and returns a reference
to this matrix.
\param angle [in]  Rotation angle.
\param axis [in]  Rotation axis.
\param center [in]  Center of rotation.

OdGeMatrix3d.translation
\details
Returns the translation vector of this matrix.

OdGeMatrix3d.translation(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix of the translation by vect.
\param vect [in]  Translation vector.

OdGeMatrix3d.setToPlaneToWorld(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps
the plane coordinate system to the WCS, and returns a reference to this matrix.
\param plane [in]  The plane.

OdGeMatrix3d.setToPlaneToWorld(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps
the plane coordinate system to the WCS, and returns a reference to this matrix.
\param normal [in]  The normal to the plane.
\remarks
If normal is specified, the origin of the plane is (0,0,0).

OdGeMatrix3d.setToWorldToPlane(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps the WCS to
the plane coordinate system, and returns a reference to this matrix.
\param plane [in]  The plane.

OdGeMatrix3d.setToWorldToPlane(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps the WCS to
the plane coordinate system, and returns a reference to this matrix.
\param normal [in]  The normal to the plane.
\remarks
If normal is specified, the origin of the plane is (0,0,0).

OdGeMatrix3d.setToAlignCoordSys(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerSe
\details
Sets this matrix to the matrix which maps
the coordinate system defined by fromOrigin, fromXAxis, fromYAxis, and fromZAxis,
to the coordinate system
defined by toOrigin, toXAxis, toYAxis, and toZAxis, and returns a reference
to this matrix.
\param fromOrigin [in]  Origin of the initial coordinate system.
\param fromXAxis [in]  X-axis of the initial coordinate system.
\param fromYAxis [in]  Y-axis of the initial coordinate system.
\param fromZAxis [in]  Z-axis of the initial coordinate system.
\param toOrigin [in]  Origin of the initial coordinate system.
\param toXAxis [in]  X-axis of the initial coordinate system.
\param toYAxis [in]  Y-axis of the initial coordinate system.
\param toZAxis [in]  Z-axis of the initial coordinate system.

OdGeMatrix3d.setToProjection(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which parallel
projects onto the specified plane in the
specified directionm and returns a reference
to this matrix.
\param projectionPlane [in]  Projection plane.
\param projectDir [in]  Projection direction.

OdGeMatrix3d.setToMirroring(OdGeLine3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which mirrors
about the specified object, and returns a reference
to this matrix.
\param mirrorLine [in]  Mirror line entity.

OdGeMatrix3d.setToMirroring(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which mirrors
about the specified object, and returns a reference
to this matrix.
\param mirrorPoint [in]  Mirror point.

OdGeMatrix3d.setToMirroring(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which mirrors
about the specified object, and returns a reference
to this matrix.
\param mirrorPlane [in]  Mirror plane.

OdGeMatrix3d.setToScaling(OdGeScale3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which scales
by scale about center, and returns a reference
to this matrix.
\param scale [in]  Scale factor.
\param center [in]  Center of scaling.

OdGeMatrix3d.setToScaling(System.Double,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which scales
by scale about center, and returns a reference
to this matrix.
\param scale [in]  Scale factor.
\param center [in]  Center of scaling.

OdGeMatrix3d.setToRotation(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which rotates
by angle about an axis passing through center, and returns a reference
to this matrix.
\param angle [in]  Rotation angle.
\param axis [in]  Rotation axis.
\param center [in]  Center of rotation.

OdGeMatrix3d.setToTranslation(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which translates
by vect, and returns a reference
to this matrix.
\param vect [in]  Translation vector.

OdGeMatrix3d.getCsZAxis
\details
Returns the Z-axis of the coordinate system
to which this matrix maps the WCS.

OdGeMatrix3d.getCsYAxis
\details
Returns the Y-axis of the coordinate system
to which this matrix maps the WCS.

OdGeMatrix3d.getCsXAxis
\details
Returns the X-axis of the coordinate system
to which this matrix maps the WCS.

OdGeMatrix3d.getCsOrigin
\details
Returns the origin of the coordinate system
to which this matrix maps the WCS.

OdGeMatrix3d.getCoordSystem(OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the origin, X-axis, Y-axis, and Z-axis of the coordinate system
to which this matrix maps the WCS.
\param origin [out]  Receives the origin of the coordinate system.
\param xAxis [out]  Receives the X-axis of the coordinate system.
\param yAxis [out]  Receives the Y-axis of the coordinate system.
\param zAxis [out]  Receives the Z-axis of the coordinate system.

OdGeMatrix3d.setCoordSystem(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps
the WCS to the coordinate system
defined by origin, X-axis, Y-axis, and Z-axis, and returns a reference
to this matrix.
\param origin [in]  Origin of the coordinate system.
\param xAxis [in]  X-axis of the coordinate system.
\param yAxis [in]  Y-axis of the coordinate system.
\param zAxis [in]  Z-axis of the coordinate system.

OdGeMatrix3d.setTranslation(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the translation part of the matrix to the specified vector.
\param vect [in]  Translation vector.

OdGeMatrix3d.det
\details
Returns the determinant of this matrix.

OdGeMatrix3d.isPerspective(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Indicates whether a matrix can be used for perspective projections.
\param tol [in]  Geomentric tolerance.
\remarks
Returns true if [3][0] or [3][1] or [3][2] elements have non-zero values considering passed tolerance.

OdGeMatrix3d.isScaledOrtho(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only the column vectors of the linear part of
this matrix are mutually perpendicular within the
specified tolerance.
\param tol [in]  Geomentric tolerance.

OdGeMatrix3d.isUniScaledOrtho(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only the columns vectors of the linear part of
this matrix are of equal length and mutually perpendicular within the
specified tolerance.
\param tol [in]  Geomentric tolerance.

OdGeMatrix3d.isEqualTo(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if matrix is identical to this one,
within the specified tolerance.
\param matrix [in]  Matrix to be compared.
\param tol [in]  Geomentric tolerance.

OdGeMatrix3d.op_Inequality(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator.

OdGeMatrix3d.op_Equality(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Equality operator.

OdGeMatrix3d.transpose
\details
Returns the transpose of this matrix.

OdGeMatrix3d.transposeIt
\details
Sets this matrix to its transpose, and returns
a reference to this matrix.

OdGeMatrix3d.isSingular(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this matrix is singular.
\remarks
* A matrix is singular if and only if its determinant == 0.
* A singular matrix cannot be inverted.

OdGeMatrix3d.inverse(OdGeMatrix3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Returns true if and only if this matrix has an inverse,
and the inverse of this matrix.
\param inverseMatrix [out]  Receives the inverse matrix.
\param tol [in]  Geometric tolerance.

OdGeMatrix3d.invert
\details
Sets this matrix to its inverse, and returns
a reference to this matrix.

OdGeMatrix3d.setToProduct(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product matrix1 * matrix2, and returns
a reference to this matrix.
\param matrix1 [in]  First 3D matrix that is multiplied.
\param matrix2 [in]  Second 3D matrix that is multiplied.

OdGeMatrix3d.postMultBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product (this matrix) * rightSide, and returns
a reference to this matrix.
\param rightSide [in]  3D matrix that will be multiplied with this matrix.

OdGeMatrix3d.preMultBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product leftSide * (this matrix), and returns
a reference to this matrix.
\param leftSide [in]  3D matrix that will be multiplied with this matrix.

OdGeMatrix3d.op_MultiplicationAssignment(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product (this matrix) * matrix, and returns
a reference to this matrix.

OdGeMatrix3d.op_Multiply(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the product (this matrix) * matrix.

OdGeMatrix3d.validateZero(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets any values within tol of 0 to 0.

OdGeMatrix3d.setToIdentity
\details
Sets this matrix to the identity matrix, and returns a reference to this matrix.

OdGeMatrix3d.#ctor
\details
Default constructor for the OdGeMatrix3d class.
\remarks
Constructs a matrix for 3D transformation operations and sets it to identity.